package com.Day2;

public class Q4array2 {

	public static void main(String[] args) {
		// 陣列是線性的
		// 一維陣列是線性的這很好理解

		int[][] a = new int[3][];
		a[0] = new int[2];
		a[1] = new int[3];
		a[2] = new int[4];
		// 那二維呢? 有人會用矩陣 m*n 來看待
		// 但上面10~12行程式，能說它是幾乘幾的矩陣?
		// 在記憶體上實際上還是一條的樣子
		// ┌───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┬───┐
		// │ 0 │ 1 │ 2 │ 0 │ 1 │ 0 │ 1 │ 2 │ 0 │ 1 │ 2 │ 3 │
		// └───┴───┴───┴───┴───┴───┴───┴───┴───┴───┴───┴───┘
		// 永遠用一維的方式看待多維的處理
		// 陣列 a 有幾個元素? -> 3個
		// 陣列 a[0] 有幾個元素? -> 2個

		for (int[] a1 : a) {
			for (int v : a1) {
				System.out.print(v + " ");
			}
			System.out.println();
		}

	}

}
